Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་རྗེས་སུ་ཡི་རང་བ་དང་ལྡན་པའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་པ་འདི་ཉིད་རབ་ཅེས་བྱའོ། །དམ་པ་ཞེས་བྱའོ། །གཙོ་བོ་ཞེས་བྱའོ། །མཆོག་ཅེས་བྱའོ།
en: Among all these, the foundation of meritorious action endowed with rejoicing that bodhisattva great beings dedicate to unsurpassed, complete enlightenment, making common cause with all beings, is said to be the best, it is said to be authentic, it is said to be foremost, {Ki.

source: །ཕུལ་ཞེས་བྱའོ། །གྱ་ནོམ་པ་ཞེས་བྱའོ། །བླ་ན་མེད་པ་ཞེས་བྱའོ། །གོང་ན་མེད་པ་ཞེས་བྱའོ།
en: II-III: 123} it is said to be supreme, it is said to be perfect, it is said to be sublime, it is said to be unsurpassed, it is said to be the highest.

source: །མཉམ་པ་མེད་པ་ཞེས་བྱའོ། །མི་མཉམ་པ་དང་མཉམ་པ་ཞེས་བྱའོ།། །།
en: It is said to be unequaled, and it is said to be equal to the unequaled. “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ། བམ་པོ་སུམ་ཅུ་དྲུག་པ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པ་རྣམས་ཀྱི་སྦྱིན་པ་ལས་བྱུང་བའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་དང་ཚུལ་ཁྲིམས་ལས་བྱུང་བ་དང་བསྒོམ་པ་ལས་བྱུང་བའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་ནི་བདག་གདུལ་བ་དང་། བདག་ཞི་བར་བྱ་བ་དང་བདག་ཡོངས་སུ་མྱ་ངན་ལས་བཟླ་བའི་ཕྱིར་ཉེ་བར་གནས་པ་སྟེ། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་དང་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་དང་།
en: If you ask why, it is because the foundation of meritorious action originating from the generosity of those who follow the vehicle of the śrāvakas and of those who follow the vehicle of the pratyekabuddhas, and the foundations of meritorious action originating from their ethical discipline and meditation, are established in order that they themselves might be disciplined, in order that they themselves might be brought to peace, and in order that they themselves might attain final nirvāṇa.

source: འཕགས་པའི་བདེན་པ་བཞི་དང་། བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་དང་རྣམ་པར་ཐར་པ་བརྒྱད་དང་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་མངོན་པར་ཤེས་པ་དྲུག་དག་ཀྱང་། བདག་གདུལ་བ་དང་།
en: Their applications of mindfulness and [other causal attributes], up to and including the noble eightfold path, the four truths of the noble ones, the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the gateways of liberation—emptiness, signlessness, and wishlessness—the eight aspects of liberation, the nine serial steps of meditative absorption, the four kinds of exact knowledge, and the six extrasensory powers, are also merely established in order that they themselves might be disciplined, in order that they themselves might be brought to peace, and in order that they themselves might attain final nirvāṇa.

source: བདག་ཞི་བར་བྱ་བ་དང་བདག་ཡོངས་སུ་མྱ་ངན་ལས་བཟླ་བའི་ཕྱིར་ཉེ་བར་གནས་པར་ཟད་ཀྱི། བྱང་ཆུབ་སེམས་དཔའ་ནི་སེམས་ཅན་ཐམས་ཅད་གདུལ་བ་དང་། ཞི་བར་བྱ་བ་དང་། ཡོངས་སུ་མྱ་ངན་ལས་བཟླ་བའི་ཕྱིར་རྗེས་སུ་ཡི་རང་བ་དང་ལྡན་པའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཤིང་། མི་དམིགས་པའི་ཚུལ་གྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོའོ།
en: On the other hand, bodhisattvas dedicate their foundation of meritorious action, endowed with rejoicing, toward unsurpassed, complete enlightenment, making common cause with all beings and without apprehending anything, in order that all beings might be disciplined, brought to peace, and attain final nirvāṇa.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མེད་ཚད་མེད་དཔག་ཏུ་མེད་པ་དག་གི། འཇིག་རྟེན་གྱི་ཁམས་རེ་རེར་ཡང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཚད་མེད་གྲངས་མེད་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་གྱུར་པ་དེ་དག་དང་། ལྷོ་དང་ནུབ་དང་བྱང་དང་བྱང་ཤར་དང་ཤར་ལྷོ་དང་ལྷོ་ནུབ་དང་ནུབ་བྱང་དང་འོག་དང་སྟེང་གི་ཕྱོགས་ཀྱི་ཕྱོགས་རེ་རེ་ཞིང་། འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མེད་ཚད་མེད་དཔག་དུ་མེད་པ་དག་གི།
en: Then the venerable Subhūti replied to the bodhisattva great being Maitreya, “Bodhisattva great beings gather together all the roots of virtuous action endowed with the six perfections possessed by immeasurable, countless lord buddhas who have passed into final nirvāṇa in each world system of the countless, immeasurable, and inestimable world systems of the eastern direction, and by immeasurable, countless lord buddhas who have passed into final nirvāṇa in each world system of the countless, immeasurable, and inestimable world systems of the southern, western, northern, northeastern, southeastern, southwestern, and northwestern directions, along with the nadir and the zenith, commencing from the time when they first begin to set their mind on enlightenment until they have attained consummate buddhahood in unsurpassed, complete enlightenment, until they have passed into final nirvāṇa in the expanse of nirvāṇa where no aggregates are left behind, and until their Dharma [comes to an end]. “[

source: །འཇིག་རྟེན་གྱི་ཁམས་རེ་རེར་ཡང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གྲངས་མེད་ཚད་མེད་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་གྱུར་པ་དེ་དག་ཐུགས་དང་པོ་བསྐྱེད་པ་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་བར་དང་། ཕུང་པོ་མ་ལུས་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་བར་གྱི་དམ་པའི་ཆོས་ཀྱི་བར་དུ་དགེ་བའི་རྩ་བ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་དང་ལྡན་པ་གང་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། ཉན་ཐོས་ཀྱི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པ་དེ་དག་གི་སྦྱིན་པ་ལས་བྱུང་བའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་དང་། ཚུལ་ཁྲིམས་ལས་བྱུང་བ་དང་། བསྒོམ་པ་ལས་བྱུང་བའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་དང་སློབ་པ་དེ་དག་གི་དགེ་བའི་རྩ་བ་ཟག་པ་མེད་པ་དག་དང་མི་སློབ་པ་དེ་དག་གི་དགེ་བའི་རྩ་བ་ཟག་པ་མེད་པ་དག་དང་།
en: They also gather together all] the foundations of meritorious action originating from the generosity of those who have entered into the vehicle of the śrāvakas, the foundations of meritorious action originating from their ethical discipline and meditation, the uncontaminated roots of virtuous action associated with [the paths] of learning, and the uncontaminated roots of virtuous action associated with [the paths] of no-more-learning. “[

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་གི་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་དང་། ཏིང་ངེ་འཛིན་གྱི་ཕུང་པོ་དང་ཤེས་རབ་ཀྱི་ཕུང་པོ་དང་རྣམ་པར་གྲོལ་བའི་ཕུང་པོ་དང་རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་གཟིགས་པའི་ཕུང་པོ་དང་ཕན་པར་བཞེད་པ་དང་ཐུགས་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་གྲངས་མེད་ཚད་མེད་པ་དང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་ཆོས་གང་བསྟན་པ་དང་ཆོས་བསྟན་པ་དེ་ལ་བསླབས་ཤིང་རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུ་ཐོབ་པ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་ཐོབ་པ་དང་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་ཐོབ་པ་དང་དགྲ་བཅོམ་པ་ཉིད་དང་རང་བྱང་ཆུབ་ཐོབ་པ་དང་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་ཞུགས་པ་དེ་དག་གི་དགེ་བའི་རྩ་བ་གང་ཇི་སྙེད་པ་དང་།
en: They also gather together] the aggregate of ethical discipline that the tathāgatas, arhats, completely awakened buddhas have, along with their aggregate of meditative stability, their aggregate of wisdom, their aggregate of liberation, and their aggregate of seeing the wisdom of liberation; their altruism, great compassion, and countless and immeasurable buddha attributes; the Dharma revealed by those lord buddhas and all the roots of virtuous action of those who have attained the fruit of entering the stream to nirvāṇa after training in that Dharma that has been revealed; and [the roots of virtuous action] of those who have attained the fruit of being destined for only one more rebirth, those who have attained the fruit on no longer being subject to rebirth, those who have attained arhatship or individual enlightenment, and those who have entered into the maturity of the bodhisattvas. “[

source: གང་གིས་དེ་བཞིན་གཤེགས་པ་དེ་དག་བཞུགས་ཀྱང་རུང་། ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཀྱང་རུང་སྟེ། དེ་དག་ལ་དགེ་བའི་རྩ་བ་གང་ཇི་སྙེད་ཅིག་བསྐྱེད་པ། དེ་ཐམས་ཅད་གཅིག་ཏུ་བསྡུས་ཏེ།
en: They also gather together] the roots of virtuous action generated by them, whether the tathāgatas are present, or whether they have passed into final nirvāṇa.

source: རྗེས་སུ་ཡི་རང་བའི་མཆོག་གཙོ་བོ་དམ་པ། རབ་ཕུལ་གྱ་ནོམ་པ་བླ་ན་མེད་པ། གོང་ན་མེད་པ། མཉམ་པ་མེད་པ། མི་མཉམ་པ་དང་མཉམ་པས་རྗེས་སུ་ཡི་རང་སྟེ།
en: They rejoice with the supreme, foremost, best, perfect, most sublime, unsurpassed, and highest rejoicing, which is unequaled and equal to the unequaled.

source: དེ་ལྟར་རྗེས་སུ་ཡི་རང་ནས། རྗེས་སུ་ཡི་རང་བ་དང་ལྡན་པའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་དེ། སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་སྒྲུབ་པར་གྱུར་ཅིག་ཅེས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་ན།
en: Having rejoiced in that manner, making common cause with all beings, they dedicate that foundation of their meritorious action, endowed with rejoicing, to unsurpassed, complete enlightenment, with the words, ‘May we accomplish unsurpassed, complete enlightenment!’

source: དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པ་དེས་དེ་སྐད་དུ་སྨྲས་ཏེ།
en: If they do this, it is said that they will have entered into the vehicle of the bodhisattvas. “

source: སེམས་ཀྱི་རྣམ་པ་དེ་ལྟ་བུས་ཡོངས་སུ་བསྔོས་ན། དམིགས་པ་གང་དང་དངོས་པོ་གང་དག་གིས་སེམས་དེ་ལྟ་བུ་སྐྱེས་པར་གྱུར་པའི་དངོས་པོ་དེ་དག་དང་། དམིགས་པ་དེ་དག་རིགས་ཀྱི་བུ་དེ་དག་གིས་ཇི་ལྟར་མཆན་མར་བྱས་པ་དེ་བཞིན་དུ་དམིགས་སུ་ཡོད་པ་ཡིན་ནམ།
en: If those noble children make this dedication with such thoughts, do they apprehend the foundations of meritorious action and their objective referents that give rise to such thoughts [of dedication], conceiving of them as a distinguishing mark?” “

source: བྱམས་པས་སྨྲས་པ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུ་དེ་དག་གིས་ཇི་ལྟར་མཚན་མར་བྱས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་པ་དེ་བཞིན་དུ། དངོས་པོ་དེ་དག་དང་། དམིགས་པ་དེ་དག་དམིགས་སུ་ཡོད་པ་མ་ཡིན་ནོ། །རབ་འབྱོར་གྱིས་སྨྲས་པ། གལ་ཏེ་དེ་ལྟར་དངོས་པོ་མེད་པ་དེ་དག་དམིགས་སུ་མེད་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ན་བཞུགས་པ་དེ་དག་དང་། དེ་དག་གི་ཐུགས་དང་པོ་བསྐྱེད་པ་ནས། དམ་པའི་ཆོས་གནས་པའི་བར་གྱི་དགེ་བའི་རྩ་བ་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་གནས་པའི་རིགས་ཀྱི་བུ་དང་། རིགས་ཀྱི་བུ་མོ་དེ་དག་གི་དགེ་བའི་རྩ་བ་གང་ཇི་སྙེད་པ་དང་། སློབ་པ་རྣམས་ཀྱི་དགེ་བའི་རྩ་བ་གང་ཇི་སྙེད་པ་དང་།
en: The noble children who follow the Great Vehicle do not apprehend the foundations of meritorious action and their objective referents in such a way that they dedicate them to unsurpassed, complete enlightenment while conceiving of them as a distinguishing mark,” replied Maitreya.

source: མི་སློབ་པ་རྣམས་ཀྱི་དགེ་བའི་རྩ་བ་གང་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་གཅིག་ཏུ་གསོགས་བསྡུས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མཚན་མའི་ཚུལ་གྱིས་ཡོངས་སུ་བསྔོས་ན། ཇི་ལྟར་མི་རྟག་པ་ལ་རྟག་གོ་ཞེས་བྱ་བར་འདུ་ཤེས་ཕྱིན་ཅི་ལོག་དང་། སེམས་ཕྱིན་ཅི་ལོག་པ་དང་། ལྟ་བ་ཕྱིན་ཅི་ལོག་ཏུ་གྱུར་པ་དང་། སྡུག་བསྔལ་བ་ལ་བདེ་ཞེས་བྱ་བ་དང་། བདག་མེད་པ་ལ་བདག་ཅེས་བྱ་བ་དང་། མི་གཙང་བ་ལ་གཙང་ཞེས་བྱ་བར་འདུ་ཤེས་ཕྱིན་ཅི་ལོག་པ་དང་།
en: Subhūti then said, “Since nonexistent foundations of meritorious action are not apprehensible, if those noble children were to gather together the roots of virtuous action of the lord buddhas who are present in the world systems of the ten directions, commencing from the time when they first begin to set their mind on enlightenment for as long as their Dharma remains, and all the roots of virtuous action of those noble sons or noble daughters who dwell in the vehicles of the śrāvakas and pratyekabuddhas, and all the roots of virtuous action of the [paths of] learning, and all those roots of virtuous action of the [paths of] no-more-learning, and then dedicate them to unsurpassed, complete enlightenment, in the manner of a distinguishing mark, they would have the mistaken idea, mistaken thought, and mistaken view that the impermanent is permanent, and they would have the mistaken idea, mistaken thought, and mistaken view that suffering is happiness, that nonself is self, and that the impure is pure.

source: སེམས་ཕྱིན་ཅི་ལོག་པ་དང་། ལྟ་བ་ཕྱིན་ཅི་ལོག་ཏུ་གྱུར་པ་དེ་ལྟར་དེའི་འདུ་ཤེས་ཕྱིན་ཅི་ལོག་ཏུ་མ་གྱུར་ཏམ།
en: But are they not without such mistaken ideas? “

source: དེ་ལྟ་ཡིན་ཡང་ཐམས་ཅད་དངོས་པོ་ཇི་ལྟ་བ་དང་།
en: Just like the foundations of meritorious actions and their objective referents, all phenomena are indeed [nonexistent].

source: དམིགས་པ་ཇི་ལྟ་བར་བྱང་ཆུབ་ཀྱང་དེ་བཞིན། སེམས་ཀྱང་དེ་བཞིན་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: Enlightenment also is similar, the mind is also similar, and the perfection of generosity, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom are also similar.

source: བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་དེ་བཞིན། གཟུགས་དང་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་།
en: Physical forms, feelings, perceptions, formative predispositions, and consciousness are also similar.

source: རྣམ་པར་ཤེས་པ་ཡང་དེ་བཞིན། མྱིག་དང་། རྣ་བ་དང་སྣ་དང་ལྕེ་དང་ལུས་དང་། ཡིད་ཀྱང་དེ་བཞིན།
en: The eyes, ears, nose, tongue, body, and mental faculty are also similar.

source: གཟུགས་དང་སྒྲ་དང་དྲི་དང་རོ་དང་རེག་དང་ཆོས་ཀྱང་དེ་བཞིན།
en: Sights, sounds, odors, tastes, tangibles, and mental phenomena are also similar.

source: ཁམས་དང་སྐྱེ་མཆེད་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཡང་དེ་བཞིན།
en: The sensory elements, the sense fields, and the links of dependent origination are also similar.

source: ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ཡང་དེ་བཞིན།
en: The emptiness of internal phenomena and the [other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are also similar.

source: དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་ཡང་དེ་བཞིན། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་།
en: The applications of mindfulness and [the other causal attributes], up to and including the noble eightfold path, are also similar.

source: གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱང་དེ་བཞིན་ཏེ། གལ་ཏེ་དེ་ལྟར་དངོས་པོ་ཇི་ལྟ་བ་དང་། དམིགས་པ་ཇི་ལྟ་བར་བྱང་ཆུབ་ཀྱང་དེ་བཞིན། སེམས་ཀྱང་དེ་བཞིན། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་དེ་བཞིན། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་དེ་བཞིན། ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ཡང་དེ་བཞིན། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་དང་། ཡང་དག་པར་སྤོང་བ་རྣམས་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་།
en: The truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the gateways of liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas are also similar. {

source: དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་།
en: Ki.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱང་དེ་བཞིན་ན་ནི། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བའི་དངོས་པོ་དེ་ནི་གང་ཞིག་ཡིན།
en: II-III: 125} “In that case, just as the foundations of meritorious action and their objective referents [are nonexistent], if enlightenment is also similar, and the mind is also similar; the perfection of generosity is also similar, and the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom are also similar; the emptiness of internal phenomena and the [other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are also similar; and the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, the noble eightfold path, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the three gateways of liberation, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas are also similar, then what are these foundations of meritorious action that are dedicated to unsurpassed, complete enlightenment?

source: དམིགས་པ་དེ་ནི་གང་ཞིག་ཡིན།
en: What are their objective referents?

source: བྱང་ཆུབ་དེ་ནི་གང་ཞིག་ཡིན།
en: What is that enlightenment?

source: སེམས་དེ་ནི་གང་ཞིག་ཡིན།
en: What is that mind?

source: དགེ་བའི་རྩ་བ་དེ་དག་ནི་གང་ཞིག་ཡིན།
en: What are those roots of virtuous action?

source: རྗེས་སུ་ཡི་རང་བ་དང་ལྡན་པའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་དེ་ནི་གང་ཞིག་ཡིན། བྱམས་པས་སྨྲས་པ།
en: What is that foundation of meritorious action endowed with rejoicing?”

source: གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་སྤྱོད་པ། སངས་རྒྱས་མང་པོ་ལ་བསྙེན་བཀུར་ཅིང་དགེ་བའི་རྩ་བ་བསྐྱེད་པར་འགྱུར་བ་དང་། དགེ་བའི་བཤེས་གཉེན་གྱིས་ཀྱང་ཡོངས་སུ་ཟིན་པ་དང་། རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པའི་ཆོས་ཐམས་ཅད་ལ་བསླབ་པ་དེ་དག་ནི། དངོས་པོ་དེ་དག་དང་། དམིགས་པ་དེ་དག་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་དང་། དགེ་བའི་རྩ་བ་དེ་དག་དང་། རྗེས་སུ་ཡི་རང་བ་དང་ལྡན་པའི་བསོད་ནམས་བྱ་བའི་དངོས་པོ་དེ་དག་མཚན་མར་བྱས་ཤིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་མི་བསྔོའོ། །དེ་དག་ནི་འདི་ལྟར་ཡོངས་སུ་བསྔོ་སྟེ་གཉིས་ཀྱི་ཚུལ་གྱིས་མ་ཡིན་ནོ། །གཉིས་སུ་མེད་པའི་ཚུལ་གྱིས་མ་ཡིན་ནོ། །མཚན་མའི་ཚུལ་གྱིས་མ་ཡིན་ནོ།
en: Maitreya replied, “Bodhisattva great beings who practice the six perfections, who venerate many buddhas, who generate the roots of virtuous action, who have also been accepted by spiritual mentors, and who train in all the attributes that are empty of their own defining characteristics, do not make this dedication to unsurpassed, complete enlightenment conceiving of those foundations of meritorious action, those objective referents, those buddhas, those roots of virtuous action, or those foundations of meritorious action endowed with rejoicing as a distinguishing mark.

source: །མཚན་མ་མེད་པའི་ཚུལ་གྱིས་མ་ཡིན་ནོ། །དམིགས་པའི་ཚུལ་གྱིས་མ་ཡིན་ནོ། །དམིགས་སུ་མེད་པའི་ཚུལ་གྱིས་མ་ཡིན་ནོ། །ཉོན་མོངས་པའི་ཚུལ་གྱིས་མ་ཡིན་ནོ། །རྣམ་པར་བྱང་པའི་ཚུལ་གྱིས་མ་ཡིན་ནོ། །སྐྱེ་བའི་ཚུལ་གྱིས་མ་ཡིན་ནོ། །འགག་པའི་ཚུལ་གྱིས་མ་ཡིན་ནོ།
en: These dedicate them not by way of duality, not by way of nonduality, not by way of signs, not by way of signlessness, not by way of apprehending, not by way of nonapprehension, not by way of affliction, not by way of purification, not by way of arising, and not by way of cessation. “

source: །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་སྤྱོད་པ་ཡང་མ་ཡིན། སངས་རྒྱས་མང་པོ་ལ་བསྙེན་བཀུར་བྱེད་བྱེད་པ་ཡང་མ་ཡིན། དགེ་བའི་རྩ་བ་བསྐྱེད་པར་གྱུར་པ་ཡང་མ་ཡིན། དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་ཟིན་པ་ཡང་མ་ཡིན། རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པའི་ཆོས་ཐམས་ཅད་ལ་བསླབས་པར་གྱུར་བ་ཡང་མ་ཡིན། དེ་དག་ནི་དངོས་པོ་དེ་དག་དང་། དམིགས་པ་དེ་དག་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་དང་། དགེ་བའི་རྩ་བ་དེ་དག་དང་། རྗེས་སུ་ཡི་རང་བ་དང་ལྡན་པའི་སེམས་བསྐྱེད་པ་དེ་དག་ལ་མཚན་མར་བྱས་ཤིང་།
en: If, however, those bodhisattvas do not practice the six perfections, do not venerate many buddhas, do not generate the roots of virtuous action, are not accepted by spiritual mentors, and do not train in all the attributes that are empty of their own defining characteristics, they will then make this dedication to unsurpassed, complete enlightenment conceiving of those foundations of meritorious action, those objective referents, those lord buddhas, those roots of virtuous action, and those thoughts endowed with rejoicing as distinguishing marks. “

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བར་འགྱུར་ཏེ། བཙུན་པ་རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དེ་ལྟར་བསྟན་པ་ནི། ཐེག་པ་ལ་གསར་དུ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའི་མདུན་དུ་མི་བཤད་དོ། །བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: Blessed Subhūti, the perfection of wisdom that is revealed in this way should not be explained in the presence of a bodhisattva who has newly entered into the vehicle.

source: བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དེ་ལྟར་བསྟན་པ་ནི། ཐེག་པ་ལ་གསར་དུ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའི་མདུན་དུ་མི་བཤད་དོ། །ནང་སྟོང་པ་ཉིད་དང་།
en: The perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity that are revealed in this way should not be explained in the presence of a bodhisattva who has newly entered into the vehicle.

source: དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་དང་། ཡང་དག་པར་སྤོང་བ་རྣམས་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དེ་ལྟར་བསྟན་པ་ནི། ཐེག་པ་ལ་གསར་དུ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའི་མདུན་དུ་མི་བཤད་དོ། །འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་།
en: The emptiness of internal phenomena and the [other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path that are revealed in this way should not be explained in the presence of a bodhisattva who has newly entered into the vehicle.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དེ་ལྟར་བསྟན་པ་ནི། ཐེག་པ་ལ་གསར་དུ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའི་མདུན་དུ་མི་བཤད་དོ།
en: The truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas that are revealed in this way should not be explained in the presence of a bodhisattva who has newly entered into the vehicle.

source: །ཐམས་ཅད་ཤེས་པ་ཉིད་དང་། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དེ་ལྟར་བསྟན་པ་ནི། ཐེག་པ་ལ་གསར་དུ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའི་མདུན་དུ་མི་བཤད་དོ། །རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་བའི་ཆོས་རྣམས་དེ་ལྟར་བསྟན་པ་ནི། ཐེག་པ་ལ་གསར་དུ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའི་མདུན་དུ་མི་བཤད་དོ།
en: Knowledge of all the dharmas, knowledge of the path, and all-aspect omniscience that are revealed in this way should not be explained in the presence of a bodhisattva who has newly entered into the vehicle.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: If you ask why, {Ki.

source: དེ་ནི་དེ་ལ་དད་པ་ཙམ་འམ། དགའ་བ་ཙམ་འམ། མོས་པ་ཙམ་འམ། གུས་པ་ཙམ་ཞིག་ཡོད་པ་དེ་ཡང་མེད་པར་འགྱུར་བའི་ཕྱིར་ཏེ།
en: II-III: 126} the mere faith that they have, the mere joy, the mere resolve, and the mere devotion that they have would be rendered nonexistent. “
